tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "skeema/tap"

# Core tools
brew "bash"
brew "fish"
brew "tmux"
brew "neovim"
brew "git"

# Development
brew "go"
brew "node@20"
brew "python@3.12"
brew "postgresql@17"

# CLI utilities
brew "atuin"           # Shell history
brew "bat"             # Better cat
brew "fd"              # Better find
brew "fzf"             # Fuzzy finder
brew "ripgrep"         # Better grep
brew "zoxide"          # Better cd
brew "direnv"          # Directory environments
brew "jq"              # JSON processor
brew "gh"              # GitHub CLI
brew "tig"             # Git TUI
brew "htop"            # Process viewer
brew "tree"            # Directory tree
brew "watch"           # Run commands repeatedly
brew "wget"            # Download tool
brew "curl"            # Transfer tool
brew "yt-dlp"          # YouTube downloader

# Language servers & tools
brew "lua-language-server"  # Neovim LSP
brew "gopls"                # Go LSP (via go install, but good to have)

# Media & graphics
brew "ffmpeg"
brew "graphviz"
brew "imagemagick"

# System utilities
brew "coreutils"
brew "gnu-sed"
brew "gnu-getopt"
brew "gnupg"
brew "git-crypt"

# Databases & services
brew "mysql-client"
brew "protobuf"
brew "grpc"

# Misc
brew "colordiff"
brew "detox"
brew "exiftool"
brew "jhead"
brew "neofetch"
brew "pandoc"
brew "telnet"
brew "terraform"

# Casks
cask "docker"
cask "ghostty"

