tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "skeema/tap"
brew "python@3.9"
brew "bash"
brew "bat"
brew "gettext"
brew "glib"
brew "cairo"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "detox"
brew "direnv"
brew "doctl"
brew "exiftool"
brew "pkg-config"
brew "unbound"
brew "harfbuzz"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-crypt"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grpc"
brew "htop"
brew "jhead"
brew "jq"
brew "jump"
brew "kustomize"
brew "mercurial"
brew "nmap"
brew "rbenv"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "sphinx-doc"
brew "st"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "z"
